//TIP To <b>Run</b> code, press <shortcut actionId="Run"/> or
// click the <icon src="AllIcons.Actions.Execute"/> icon in the gutter.
fun main() {
    print("----------------------------------------------[Типы данных в Kotlin]---------------------------------------------------\n\n" +
            "В Kotlin все компоненты программы, в том числе переменные, представляют объекты, которые имеют определенный тип данных.\n" +
            "Тип данных определяет, какой размер памяти может занимать объект данного типа и какие операции с ним можно производить.\n" +
            "В Kotlin есть несколько базовых типов данных: числа, символы, строки, логический тип и массивы.\n\n" +
            "Целочисленные типы:\n" +
            " - Byte: хранит целое число от -128 до 127 и занимает 1 байт\n" +
            " - Short: хранит целое число от -32 768 до 32 767 и занимает 2 байта\n" +
            " - Int: хранит целое число от -2 147 483 648 (-231) до 2 147 483 647 (231 - 1) и занимает 4 байта\n" +
            " - Long: хранит целое число от –9 223 372 036 854 775 808 (-263) до 9 223 372 036 854 775 807 (263-1) и занимает 8 байт\n\n" +
            "Числа с плавающей точкой:\n" +
            " - Float: хранит число с плавающей точкой от -3.4*1038 до 3.4*1038 и занимает 4 байта\n" +
            " - Double: хранит число с плавающей точкой от ±5.0*10-324 до ±1.7*10308 и занимает 8 байта.\n\n" +
            "Логический тип Boolean:\n" +
            " - Boolean: может хранить одно из двух значений: true (истина) или false (ложь).\n\n" +
            "Символы:\n" +
            " - Char: представляет отдельный символ, который заключается в одинарные кавычки.\n\n" +
            "Строки:\n" +
            " - String: представляет последовательность символов, заключенную в двойные кавычки, либо в тройные двойные кавычки.\n\n" +
            "----------------------------------------------[Типы данных в Kotlin]---------------------------------------------------\n")
}