fun main() {
    print(
            "+------------------+\n" +
            "| 1 - яйца всмятку |\n" +
            "| 2 - яйца вкрутую |\n" +
            "| 3 - яичница      |\n" +
            "| 4 - омлет        |\n" +
            "| 5 - рис          |\n" +
            "| 6 - картофель    |\n" +
            "+------------------+\n")

    print("Введите тип пищи для приготовления: ")
    val foodType = readln().toInt()
    var result = "?"

    when(foodType){
        1 -> result = " - 5–6 минут"
        2 -> result = " - 10–12 минут"
        3 -> result = " - 6–7 минут"
        4 -> result = " - 7–10 минут"
        5 -> result = " - 20 минут"
        6 -> result = " - 30-35 минут"
        else -> print ("ошибка")
    }

    println(result)
}